Revit 2027 API
BuiltInFailures.MEPFabricationFailures.NoStructuralHostToAttachWarning Property
 There is no structural component to attach the hanger rod to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoStructuralHostToAttachWarning { get; }
Public Shared ReadOnly Property NoStructuralHostToAttachWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoStructuralHostToAttachWarning {
	FailureDefinitionId^ get ();
}
static member NoStructuralHostToAttachWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace